/**
-- Odin JavaScript --------------------------------------------------------------------------------
	VIP Cab - Victoria Road : Lith Harbor (104000000)
-- By ---------------------------------------------------------------------------------------------
	Xterminator
-- Version Info -----------------------------------------------------------------------------------
	1.0 - First Version by Xterminator
---------------------------------------------------------------------------------------------------
**/
var status = 0;
var selectedType = -1;
var selectedItem = -1;
var stimulator = false;
var itemSet;
var item;
var mats;
var matQty;
var cost;
var add;

var wq = Array(
Array(1702974,6000),                     //武器（物品代码，价格）
Array(1702987,6000),
Array(1703011,6000),
Array(1703014,6000),
Array(1703024,6000),
Array(1703027,6000),
Array(1703032,6000),
Array(1703042,6000),
Array(1703067,6000),
Array(1703076,6000),
Array(1703077,6000),
Array(1703089,6000),
Array(1703091,6000),
Array(1703093,6000),
Array(1703102,6000),
Array(1703138,6000),
Array(1703139,6000),
Array(1703147,6000),
Array(1703164,6000),
Array(1703171,6000),
Array(1703177,6000),
Array(1703185,6000),
Array(1703193,6000),
Array(1703204,6000),
Array(1703229,6000),
Array(1703240,6000),
Array(1703243,6000),
Array(1703253,6000),
Array(1703255,6000),
Array(1703259,6000),
Array(1703304,6000),
Array(1703311,6000),
Array(1703326,6000),
Array(1703398,6000),
Array(1703402,6000),
Array(1703451,6000),
Array(1703473,6000),
Array(1703504,6000),
Array(1703520,6000),
Array(1703565,6000),
Array(1703578,6000),
Array(1703580,6000),
Array(1703582,6000),
Array(1703620,6000),
Array(1703650,6000),
Array(1703668,6000),
Array(1703683,6000),
Array(1703753,6000),
Array(1703816,6000),
Array(1703852,6000),
Array(1702825,6000),
Array(1703178,6000),
Array(1703373,6000)
);

var yf = Array(
Array(1042000,6000),                     //上衣（物品代码，价格）
Array(1042001,6000),
Array(1042002,6000),
//Array(1042003,6000),  //GM衣服
Array(1042004,6000),
Array(1042005,6000),
Array(1042006,6000),
Array(1042007,6000),
Array(1042008,6000),
Array(1042009,6000),
Array(1042010,6000),
Array(1042011,6000),
Array(1042012,6000),
Array(1042013,6000),
Array(1042014,6000),
Array(1042015,6000),
Array(1042016,6000),
Array(1042017,6000),
Array(1042018,6000),
Array(1042019,6000),
Array(1042020,6000),
Array(1042021,6000),
Array(1042022,6000),
Array(1042023,6000),
Array(1042024,6000),
Array(1042025,6000),
Array(1042026,6000),
Array(1042027,6000),
Array(1042028,6000),
Array(1042029,6000),
Array(1042030,6000),
Array(1042031,6000),
Array(1042032,6000),
Array(1042033,6000),
Array(1042034,6000),
Array(1042035,6000),
Array(1042036,6000),
Array(1042037,6000),
Array(1042038,6000),
Array(1042039,6000),
Array(1042040,6000),
Array(1042041,6000),
Array(1042042,6000),
Array(1042043,6000),
Array(1042044,6000),
Array(1042045,6000),
Array(1042046,6000),
Array(1042047,6000),
Array(1042048,6000),
Array(1042049,6000),
Array(1042050,6000),
Array(1042051,6000),
Array(1042052,6000),
Array(1042053,6000),
Array(1042054,6000),
Array(1042055,6000),
Array(1042056,6000),
Array(1042057,6000),
Array(1042058,6000),
Array(1042059,6000),
Array(1042060,6000)
);

var kz = Array(
Array(1062130,6000),                     //裤子（物品代码，价格）
Array(1062131,6000),
Array(1062133,6000),
Array(1062134,6000),
Array(1062135,6000),
Array(1062136,6000),
Array(1062137,6000),
Array(1062138,6000),
Array(1062139,6000),
Array(1062140,6000),
Array(1062141,6000),
Array(1062142,6000),
Array(1062143,6000),
Array(1062144,6000),
Array(1062145,6000),
Array(1062146,6000),
Array(1062147,6000),
Array(1062148,6000),
Array(1062149,6000),
Array(1062150,6000),
Array(1062151,6000),
Array(1062152,6000),
Array(1062153,6000),
Array(1062154,6000),
Array(1062155,6000),
Array(1062156,6000),
Array(1062157,6000),
Array(1062158,6000),
Array(1062159,6000),
Array(1062160,6000),
Array(1062161,6000),
Array(1062162,6000),
Array(1062163,6000),
Array(1062171,6000),
Array(1062172,6000),
Array(1062173,6000),
Array(1062174,6000),
Array(1062175,6000),
Array(1062176,6000),
Array(1062179,6000),
Array(1062182,6000),
Array(1062183,6000),
Array(1062184,6000),
Array(1062185,6000),
Array(1062186,6000),
Array(1062187,6000),
Array(1062188,6000),
Array(1062189,6000),
Array(1062203,6000)
);

var tz = Array(
Array(1052660,6000),                     //套装（物品代码，价格）
Array(1052661,6000),
Array(1052666,6000),
Array(1052667,6000),
Array(1052668,6000),
Array(1052669,6000),
Array(1052671,6000),
//Array(1052673,80000),
Array(1052674,6000),
Array(1052675,6000),
Array(1052684,6000),
Array(1052686,6000),
Array(1052687,6000),
Array(1052691,6000),
Array(1052692,6000),
Array(1052693,6000),
Array(1052697,6000),
Array(1052698,6000),
Array(1052707,6000),
Array(1052708,6000),
Array(1052709,6000),
Array(1052713,6000),
Array(1052724,6000),
Array(1052725,6000),
Array(1052726,6000),
Array(1052727,6000),
Array(1052728,6000),
Array(1052731,6000),
Array(1052746,6000),
Array(1052747,6000),
//Array(1052748,50000),
Array(1052749,6000),
Array(1052750,6000),
Array(1052754,6000),
Array(1052756,6000),
Array(1052757,6000),
Array(1052761,6000),
Array(1052762,6000),
Array(1052771,6000),
Array(1052772,6000),
Array(1052773,6000),
Array(1052774,6000),
Array(1052779,6000),
Array(1052781,6000),
Array(1052782,6000),
Array(1052841,6000),
Array(1052842,6000),
Array(1052843,6000),
Array(1052844,6000),
Array(1052845,6000),
Array(1052846,6000),
Array(1052849,6000),
Array(1052850,6000),
Array(1052852,6000),
Array(1052853,6000),
Array(1052854,6000),
Array(1052855,6000),
Array(1052856,6000),
Array(1052857,6000),
Array(1052858,6000),
Array(1052859,6000)
);

var st = Array(
Array(1082500,6000),                     //手套（物品代码，价格）
Array(1082501,6000),
Array(1082502,6000),
Array(1082503,6000),
Array(1082504,6000),
Array(1082505,6000),
Array(1082520,6000),
Array(1082525,6000),
Array(1082527,6000),
Array(1082551,6000),
Array(1082552,6000),
Array(1082618,6000),
Array(1082620,6000),
Array(1082631,6000),
Array(1082685,6000),
Array(1082689,6000)
);

var xz = Array(
Array(1072999,6000),                     //鞋子（物品代码，价格）
Array(1073008,6000),
Array(1073009,6000),
Array(1073010,6000),
Array(1073008,6000),
Array(1073011,6000),
Array(1073012,6000),
Array(1073013,6000),
Array(1073014,6000),
//Array(1073017,80000),
Array(1073019,6000),
Array(1073022,6000),
Array(1073023,6000),
Array(1073024,6000),
Array(1073025,6000),
Array(1073027,6000),
//Array(1073030,100000),
//Array(1073032,100000),
//Array(1073033,100000),
//Array(1073034,100000),
//Array(1073035,100000),
Array(1073036,6000),
Array(1073037,6000),
Array(1073039,6000),
Array(1073040,6000),
Array(1073041,6000),
Array(1073044,6000),
Array(1073046,6000),
Array(1073047,6000),
Array(1073050,6000),
Array(1073051,6000),
Array(1073052,6000),
Array(1073055,6000),
Array(1073056,6000),
//Array(1073057,100000),
Array(1073058,6000),
Array(1073059,6000),
Array(1073060,6000),
Array(1073061,6000),
Array(1073062,6000),
Array(1073074,6000),
Array(1073075,6000),
Array(1073076,6000),
//Array(1073077,70000),
Array(1073078,6000),
Array(1073079,6000),
Array(1073080,6000),
Array(1073081,6000),
Array(1073082,6000),
Array(1073084,6000),
Array(1073085,6000),
Array(1073088,6000),
Array(1073090,6000),
Array(1073091,6000),
Array(1073092,6000),
Array(1073093,6000),
Array(1073094,6000),
Array(1073095,6000),
Array(1073097,6000),
Array(1073098,6000)
);

var sp = Array(
Array(1115003,6000),                     //饰品（物品代码，价格）
Array(1115004,6000),
Array(1115005,6000),
Array(1115006,6000),
Array(1115007,6000),
Array(1115008,6000),
Array(1115009,6000),
Array(1115010,6000),
Array(1115011,6000),
Array(1115015,6000),
Array(1115018,6000),
Array(1115022,6000),
Array(1115023,6000),
Array(1112724,6000)
);

var mz = Array(
Array(1004540,6000),                     //帽子（物品代码，价格）
Array(1004635,6000), //毛线编织帽
Array(1002960,6000), //暗夜娃娃皇冠
Array(1004639,6000), //北极罩帽
Array(1004665,6000), //暖绒兔兔帽
Array(1004638,6000), //茅山道士帽
Array(1004592,6000), //紫色时间
Array(1004592,6000), //粉色时间
Array(1004589,6000), //侠盗猫眼罩
Array(1004570,6000), //黑色海魂帽
Array(1004571,6000), //海贼团贝雷帽
Array(1004541,6000), //茶会大蝴蝶结
Array(1004540,6000), //奥尔卡的睡帽
Array(1004506,6000), //白色兔耳发带
Array(1004504,6000), //贵族花纹帽子
Array(1004499,6000), //蓝色金鱼帽子
Array(1004500,6000), //蓝色金鱼帽子
Array(1004491,6000), //西红柿帽子
Array(1004481,6000), //反抗者护目镜
Array(1004480,6000), //小淘气的飞行帽
Array(1004470,6000), //毛绒雷锋帽
Array(1004469,6000), //爱情宣言
Array(1004463,6000), //方块兔帽子
Array(1004448,6000), //黑色啵啵鼠帽
Array(1004409,6000), //松鼠的休闲帽
Array(1004403,6000), //嘻哈兔子
Array(1004405,6000), //睡虎休闲帽
Array(1004397,6000), //清扫头巾
Array(1004336,6000), //暴走斯乌假发
Array(1004330,6000), //奢华羊绒小礼帽
Array(1004329,6000), //蓝色棒球帽发夹
Array(1004324,6000), //防毒面罩
Array(1004294,6000), //甜柿帽
Array(1004295,6000), //音乐飞天小鸡帽
Array(1004296,6000), //萌动飞天小鸡帽
Array(1004298,6000), //泰迪萌犬帽(白)
Array(1004299,6000), //泰迪萌犬帽(白)
Array(1004275,6000), //幸运帽
Array(1004269,6000), //苹果蒂风情帽
Array(1004239,6000), //桃太郎帽子
Array(1004212,6000), //晶莹精致丝带
Array(1004211,6000), //哈尼绒绒耳
Array(1004202,6000), //隐武士战盔
Array(1004200,6000), //夏日兔草帽
Array(1004198,6000), //太极发箍
Array(1004196,6000), //风车头箍
Array(1004194,6000), //蝴蝶结贝雷帽
Array(1004169,6000), //美味荷包蛋帽
Array(1004171,6000), //旋转木马帽
Array(1004163,6000), //爱丽丝表丝带
Array(1004158,6000), //鼠鼠派对发箍
Array(1004025,6000), //绿猫猫帽子
Array(1004033,6000), //红猫猫帽子
Array(1004003,6000), //粉红猫耳套头帽
Array(1003968,6000), //巧克力绵羊玩偶帽
Array(1003951,6000), //欧黛特头箍
Array(1003952,6000), //欧黛特头箍
Array(1003937,6000), //浪漫斗笠
Array(1003917,6000), //粉红太阳镜帽
Array(1003900,6000), //蓝色桃心透明帽子
Array(1003859,6000), //满天星普赛克
Array(1003847,6000), //鬼剑士假发
Array(1003831,6000), //卷卷绵羊发卡
Array(1003777,6000), //伶俐猫咪斗篷
Array(1003778,6000), //可爱猫咪斗篷
Array(1003779,6000), //爱丽丝兔兔帽
Array(1003763,6000), //黑色之翼首领帽
Array(1003710,6000), //[MS折扣]怪医黑杰克帽
Array(1003417,6000), //恐龙帽子
Array(1003203,6000), //小红帽
Array(1003149,6000), //洛比尔兔子斗篷
Array(1003146,6000), //蕾丝蝴蝶结发箍
Array(1003147,6000), //天蓝女仆头饰
Array(1003131,6000), //黑色精致丝带
Array(1003122,6000), //黄色兔兔巾
Array(1003123,6000), //黄色兔兔巾
Array(1003109,6000), //皇家彩虹斗篷
Array(1002976,6000), //女仆头饰
Array(1002721,6000), //狸毛护耳
Array(1002704,6000), //黄独眼怪婴
Array(1002691,6000), //半人马假发(棕色)
Array(1002695,6000), //幽灵帽
Array(1004636,6000), //香蕉郊游帽
Array(1004602,6000), //农夫的瑰宝
Array(1004601,6000), //小企鹅帽子
Array(1004589,6000), //侠盗猫眼罩
Array(1004570,6000), //黑色海魂帽
Array(1004571,6000), //海贼团贝雷帽
Array(1004568,6000), //呆萌鼠鼠帽
Array(1004543,6000) //复古头巾
);

var dm = Array(
    Array(1008956, 6000, "佩恩"),
    Array(1008955, 6000, "20250830：萨博"),
    Array(1008953, 6000, "20250830：娜美"),
    Array(1008950, 6000, "20250830：哈尔"),
    Array(1008948, 6000, "20250830：圣女贞德"),
    Array(1008946, 6000, "20250830：星见亚砂"),
    Array(1008960, 6000, "20250830：纲"),
    Array(1008942, 6000, "20250830：星"),
    Array(1008940, 6000, "20250830： 沢田纲吉"),
    Array(1008939, 6000, "20250830：天使-艾丽莎"),
    Array(1008933, 6000, "20250830：露米"),
    Array(1008959, 6000, "20250830：黑色少女"),
    Array(1008927, 6000, "20250830： 天使"),
    Array(1008926, 6000, "20250830：迪达拉"),
    Array(1008923, 6000, "20250830：花江"),
    Array(1008918, 6000, "20250830：黑岩射手"),
    Array(1008913, 6000, "20250830：血月"),
    Array(1008910, 6000, "20250830：潘多拉"),
    Array(1008901, 6000, "20250830：斗笠死灵"),
    Array(1008900, 6000, "20250830：带土"),
    Array(1008906, 6000, "20250830：莉央"),
    Array(1008929, 6000, "20250830：咖喱柴犬"),
    Array(1009911, 6000, "宇智波鼬"),
    Array(1009912, 6000, "火影四代目"),
    Array(1009913, 6000, "鸣人发光-最终"),
    Array(1009914, 6000, "鸣人小新"),
    Array(1009915, 6000, "佐助3"),
    Array(1009916, 6000, "雏田"),
    Array(1009917, 6000, "纲手"),
    Array(1009918, 6000, "八门夜凯"),
    Array(1009919, 6000, "小南"),
    Array(1009920, 6000, "小樱"),
    Array(1009921, 6000, "迪达拉"),
    Array(1009923, 6000, "止水"),
    Array(1009930, 6000, "卡卡西坐下"),
    Array(1009943, 6000, "蝎"),
    Array(1009922, 6000, "艾斯"),
    Array(1009924, 6000, "尼卡路飞"),
    Array(1009927, 6000, "海贼王大和"),
    Array(1009937, 6000, "四皇路飞"),
    Array(1009938, 6000, "威尔"),
    Array(1009939, 6000, "夏油杰"),
    Array(1009928, 6000, "黑崎一护"),
    Array(1009929, 6000, "红发香克斯"),
    Array(1009931, 6000, "桔梗X犬夜叉"),
    Array(1009932, 6000, "弗利沙"),
    Array(1009925, 6000, "不知火舞"),
    Array(1009926, 6000, "草薙京"),
    Array(1009934, 6000, "魔人布欧"),
    Array(1009933, 6000, "eva明日香"),
    Array(1009935, 6000, "圣斗士白羊座wu"),
    Array(1009936, 6000, "手枪+大刀版吴彦祖（最终版 水印）"),
    Array(1009940, 6000, "自在极意 白悟空"),
    Array(1009941, 6000, "艾尼路"),
    Array(1009942, 6000, "阿拉蕾"),
    Array(1009944, 6000, "帝皇龙甲兽"),
    Array(1009945, 6000, "粉红幻影大剑 全残影"),
    Array(1009946, 6000, "杀生丸"),
    Array(1009947, 6000, "天女兽"),
    Array(1009948, 6000, "军曹"),
    Array(1009949, 6000, "杰尼龟"),
    Array(1009950, 6000, "女帝"),
    Array(1009951, 6000, "远坂凛"),
    Array(1009952, 6000, "黑saber"),
    Array(1009953, 6000, "黑saber2"),
    Array(1009954, 6000, "高达"),
    Array(1009955, 6000, "光能使者阿祖"),
    Array(1009956, 6000, "海绵宝宝"),
    Array(1009957, 6000, "恐龙小新"),
    Array(1009958, 6000, "蜡笔小新 黑道"),
    Array(1009959, 6000, "蜡笔小新"),
    Array(1009960, 6000, "雷电将军"),
    Array(1009961, 6000, "墨镜五条悟"),
    Array(1009962, 6000, "尼卡定制3版本混合（水印）"),
    Array(1009963, 6000, "尼卡小新"),
    Array(1009964, 6000, "尼卡小新~(绝版不出售)"),
    Array(1009965, 6000, "骑车小新"),
    Array(1009966, 6000, "睡衣小新"),
    Array(1009967, 6000, "五条悟合体"),
    Array(1009968, 6000, "星见雅"),
    Array(1009969, 6000, "星穹1"),
    Array(1009970, 6000, "一拳超人"),
    Array(1009971, 6000, "一拳超人1"),
    Array(1009972, 6000, "泳衣成品"),
    Array(1009973, 6000, "泳装枪手"),
    Array(1009974, 6000, "圆神"),
    Array(1009975, 6000, "天使法"),
    Array(1009976, 6000, "天使枪"),
    Array(1009977, 6000, "托尔龙女仆"),
    Array(1009978, 6000, "家庭教师"),
    Array(1009979, 6000, "芙莉莲"),
    Array(1009980, 6000, "麻仓叶"),
    Array(1009981, 6000, "白贞德"),
    Array(1009982, 6000, "ALN4"),
    Array(1009983, 6000, "Q版星见雅"),
    Array(1009984, 6000, "超天酱"),
    Array(1009985, 6000, "纯爱战神"),
    Array(1009986, 6000, "独自升级"),
    Array(1009987, 6000, "独自升级程小雨"),
    Array(1009988, 6000, "红莲暗影"),
    Array(1009989, 6000, "瞌睡兔"),
    Array(1009990, 6000, "莉央完成"),
    Array(1009991, 6000, "千寻"),
    Array(1009992, 6000, "蛇女"),
    Array(1009993, 6000, "水兵月"),
    Array(1009994, 6000, "死灵姐姐"),
    Array(1009995, 6000, "妖梦"),
    Array(1009996, 6000, "小恶魔"),
    Array(1009997, 6000, "铃仙"),
    Array(1009998, 6000, "琪露诺"),
    Array(1009999, 6000, "蕾米莉亚")
);


function start() {
    cm.getPlayer().setCS(true);
    var text = "亲爱的老板~请问您想要什么样的点装呢?#b\r\n";
    text += "#d点卷余额：#b" + cm.getPlayer().getCashShop().getCash(1) + "#k\r\n";
    text += "#d抵用余额：#b" + cm.getPlayer().getCashShop().getCash(4) + "#k#n\r\n";
    var options = new Array("武器", "上衣", "裤子", "套服", "手套", "鞋子", "饰品", "帽子");

    for (var i = 0; i < options.length; i++){
        text += "\r\n#L" + i + "# " + options[i] + "#l";
    }
    cm.sendSimple(text);
}

function action(mode, type, selection) {
    if (mode > 0)
        status++;
    else {
        cm.dispose();
        return;
    }
    if (status == 1) {
        selectedType = selection;
        if (selectedType == 0) { //武器
            add ="请选择你想要的点装\r\n#r注意：描述很多有误，并非所有武器可用！#k\r\n";
            itemSet = wq;
                for (i = 0; i < itemSet.length; i++) {
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
            //cm.sendOk("有bug，武器点装兑换暂时关闭！其他点装仍可兑换。");
            //cm.dispose();
        } else if (selectedType == 1){ //上衣
            add ="请选择你想要的点装\r\n";
            itemSet = yf;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 2){ //裤子
            add ="请选择你想要的点装\r\n";
            itemSet = kz;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 3){ //套服
            add ="请选择你想要的点装\r\n";
            itemSet = tz;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 4){ //手套
            add ="请选择你想要的点装\r\n";
            itemSet = st;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 5){ //鞋子
            add ="请选择你想要的点装\r\n";
            itemSet = xz;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 6){ //饰品
            add ="请选择你想要的点装\r\n";
            itemSet = sp;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 7){ //帽子
            add ="请选择你想要的点装\r\n";
            itemSet = mz;
                for (i = 0; i < itemSet.length; i++) {	
                    add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                    add += itemSet[i][0]+"#"+"    需要点卷:#r " + itemSet[i][1]+"#l#k";
                };
            cm.sendSimple(add,2);
        } else if (selectedType == 8) { //动漫皮肤
            add = "请选择你想要的动漫帽子\r\n";
            itemSet = dm;
            for (i = 0; i < itemSet.length; i++) {
                add += "\r\n#L" + i + "##v " + itemSet[i][0] + "##z";
                add += itemSet[i][0] + "#" + "    需要点卷:#r " + itemSet[i][1] + "#l#k";
            }
            cm.sendSimple(add, 2);
        }
    } else if (status == 2) {
        selectedItem = selection;
            item = itemSet[selectedItem][0];
            cost = itemSet[selectedItem][1];
            var bdd ="你确定要购买\r\n";
            bdd += "\r\n#i" +item+"# "+ " #t" + item + "#";
            bdd += "    需要点卷:#r " + cost + "\r\n";
            cm.sendYesNo(bdd);
     } else if (status == 3) {
            if (cm.getPlayer().getCashShop().getCash(1) < cost) {
                        cm.sendOk("#b您的点券不足");
	        cm.dispose();
            } else {
            	        cm.getPlayer().getCashShop().gainCash(1, -cost);//点券
            	        cm.gainItem(item);
                        cm.sendOk("#b购买成功");
	        cm.dispose();
            }
            cm.dispose();
    }
}